In [4]:
L = range(1000)
print(L)

range(0, 1000)

In [3]:
%timeit [i**2 for i in L]

456 µs ± 14.5 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [6]:
import numpy as np

In [7]:
a = np.arange(1000)

In [8]:
%timeit a**2

2.38 µs ± 87.4 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [12]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [15]:
dataset = pd.read_csv('Salary_Data.csv')

In [16]:
dataset[0:2]

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0

In [18]:
dataset[5:7]

   YearsExperience   Salary
5              2.9  56642.0
6              3.0  60150.0

In [20]:
dataset[0:10:2]

   YearsExperience   Salary
0              1.1  39343.0
2              1.5  37731.0
4              2.2  39891.0
6              3.0  60150.0
8              3.2  64445.0

In [21]:
a = [1,22,3,4,5,6]

In [23]:
a[0:5:2]

[1, 3, 5]

In [24]:
b = [2,4,5,6,7,8]

In [26]:
a + b

[1, 22, 3, 4, 5, 6, 2, 4, 5, 6, 7, 8]

In [28]:
a1 = list([1,22,3,4,5,6])

In [31]:
[a111/2 for a111 in a]

[0.5, 11.0, 1.5, 2.0, 2.5, 3.0]